Tekla Open API Reference for Tekla Structures 2025
DrawingCoordinateConverter Methods
Methods
Name | Description
Convert(ViewBase, ViewBase, PointList)
 Converts a list of coordinate points from one view's coordinate system to another view's coordinate system.
Convert(ViewBase, ViewBase, Point)
 Converts one coordinate point from one view's coordinate system to another view's coordinate system.
Top
See Also
Reference
DrawingCoordinateConverter Class
Tekla.Structures.Drawing.Tools Namespace